package by.vadarod.practice_task1;

public class Task1_1 {
    public static void main(String[] args) {
        //1. Дано уравнение: (10+12)*x=88;. Найти значение x. Наведите курсор на сообщение, чтобы закрепить его keep

        int x;
        System.out.println("значение х равно: " + 88 / (10+12));

    }
}

